spec/fixtures/translator/microsoft_post.xml

<?xml version="1.0" encoding="UTF-8"?><env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:v2="http://api.microsofttranslator.com/V2" xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:arr="http://schemas.microsoft.com/2003/10/Serialization/Arrays"><env:Body><v2:TranslateArray><v2:texts><arr:string>Beer</arr:string></v2:texts><v2:from>en</v2:from><v2:to>de</v2:to><v2:category>general</v2:category><v2:contentType>text/plain</v2:contentType></v2:TranslateArray></env:Body></env:Envelope>
