dlls/BingDetectRequestTemplate.xml

<?xml version="1.0" encoding="utf-8"?><e:Envelope xmlns:e="http://schemas.xmlsoap.org/soap/envelope/"><e:Body><Detect xmlns="http://api.microsofttranslator.com/V2"><appId>0DF2CA3798F2F92586263AB40D150C8D99931D15</appId><text>%1</text></Detect></e:Body></e:Envelope>