dlls/BingGetLanguageNamesRequestTemplate.xml

<?xml version="1.0" encoding="utf-8"?><e:Envelope xmlns:e="http://schemas.xmlsoap.org/soap/envelope/" xmlns:a="http://schemas.microsoft.com/2003/10/Serialization/Arrays"><e:Body><GetLanguageNames xmlns="http://api.microsofttranslator.com/V2"><appId>0DF2CA3798F2F92586263AB40D150C8D99931D15</appId><locale>%1</locale><languageCodes>%2</languageCodes></GetLanguageNames></e:Body></e:Envelope>